In [43]:
import pandas as pd
from datetime import datetime

In [44]:
df = pd.read_excel('transacoes.xlsx')
df

,Tipo,Descrição,Categoria,Valor,Forma de Transação,Ano,Mês,Dia,Hora
0,Entrada,emprestimo,Empréstimos,60.00,Pix,2024,9,1,09:17:50
1,Saída,cbs Valeska,Lazer,30.00,Pix,2024,9,1,09:18:30
2,Saída,Charles,Outros,6.50,Pix,2024,9,3,09:18:57
3,Saída,Ana Paula,Outros,17.32,Pix,2024,9,3,09:19:26
4,Saída,pão,Alimento,0.90,Pix,2024,9,3,09:19:53
...,...,...,...,...,...,...,...,...,...
121,Entrada,leandro,Outros,20.00,Pix,2024,9,28,10:39:12
122,Saída,uber,Transporte,5.60,Pix,2024,9,28,10:39:35
123,Saída,cbs Valeska,Lazer,15.00,Pix,2024,9,28,10:40:03
124,Saída,uber,Transporte,4.00,Pix,2024,9,28,10:40:40
125,Saída,padaria,Alimento,2.70,Pix,2024,9,29,10:41:12

In [45]:
df.isnull().sum()

Tipo                  0
Descrição             0
Categoria             0
Valor                 0
Forma de Transação    0
Ano                   0
Mês                   0
Dia                   0
Hora                  0
dtype: int64

In [46]:
df.describe()

             Valor     Ano    Mês         Dia
count   126.000000   126.0  126.0  126.000000
mean     45.213889  2024.0    9.0   14.484127
std     139.703181     0.0    0.0    8.024696
min       0.900000  2024.0    9.0    1.000000
25%       4.567500  2024.0    9.0    7.000000
50%       6.500000  2024.0    9.0   14.000000
75%      20.000000  2024.0    9.0   21.000000
max    1296.180000  2024.0    9.0   29.000000

In [47]:
df.groupby('Tipo')['Valor'].sum()

Tipo
Entrada    2676.93
Saída      3020.02
Name: Valor, dtype: float64

In [49]:
df.groupby('Categoria')['Valor'].sum()

Categoria
Alimento        539.77
Empréstimos     327.00
Esposte         129.90
Lazer           360.00
Moradia         600.00
Outros         1149.49
Salário        2131.93
Transporte      258.86
Vestiuário      200.00
Name: Valor, dtype: float64

In [53]:
df.groupby('Forma de Transação')['Valor'].sum()

Forma de Transação
Pix    5696.95
Name: Valor, dtype: float64